Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/fuses.h
/* -------- FUSES_FBCFG6 : (FUSES Offset: 0x104) (R/W 32) RESERVED -------- */
#define FUSES_FBCFG6_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_FBCFG6) RESERVED  Reset Value */

#define FUSES_FBCFG6_Msk                      _UINT32_(0x00000000)                                 /* (FUSES_FBCFG6) Register Mask  */


/* -------- FUSES_FUSERID : (FUSES Offset: 0x108) (R/W 32) USER Page USERID -------- */
#define FUSES_FUSERID_RESETVALUE              _UINT32_(0xFFFF)                                     /*  (FUSES_FUSERID) USER Page USERID  Reset Value */

#define FUSES_FUSERID_USER_ID_Pos             _UINT32_(0)                                          /* (FUSES_FUSERID) User unique ID, readable using the JTAG USER_ID instruction Position */
#define FUSES_FUSERID_USER_ID_Msk             (_UINT32_(0xFFFF) << FUSES_FUSERID_USER_ID_Pos)      /* (FUSES_FUSERID) User unique ID, readable using the JTAG USER_ID instruction Mask */
#define FUSES_FUSERID_USER_ID(value)          (FUSES_FUSERID_USER_ID_Msk & (_UINT32_(value) << FUSES_FUSERID_USER_ID_Pos)) /* Assigment of value for USER_ID in the FUSES_FUSERID register */
#define FUSES_FUSERID_Msk                     _UINT32_(0x0000FFFF)                                 /* (FUSES_FUSERID) Register Mask  */


/* -------- FUSES_DEVCFG4 : (FUSES Offset: 0x10C) (R/W 32) USER Page CFGCON4 Fuses -------- */
#define FUSES_DEVCFG4_RESETVALUE              _UINT32_(0x840E4000)                                 /*  (FUSES_DEVCFG4) USER Page CFGCON4 Fuses  Reset Value */

#define FUSES_DEVCFG4_SOSCCFG_Pos             _UINT32_(0)                                          /* (FUSES_DEVCFG4) SOSC Configuration Position */
#define FUSES_DEVCFG4_SOSCCFG_Msk             (_UINT32_(0xFF) << FUSES_DEVCFG4_SOSCCFG_Pos)        /* (FUSES_DEVCFG4) SOSC Configuration Mask */
#define FUSES_DEVCFG4_SOSCCFG(value)          (FUSES_DEVCFG4_SOSCCFG_Msk & (_UINT32_(value) << FUSES_DEVCFG4_SOSCCFG_Pos)) /* Assigment of value for SOSCCFG in the FUSES_DEVCFG4 register */
#define FUSES_DEVCFG4_RTCEVENT_SEL_Pos        _UINT32_(8)                                          /* (FUSES_DEVCFG4) RTC Event Selection Position */
#define FUSES_DEVCFG4_RTCEVENT_SEL_Msk        (_UINT32_(0x3) << FUSES_DEVCFG4_RTCEVENT_SEL_Pos)    /* (FUSES_DEVCFG4) RTC Event Selection Mask */
#define FUSES_DEVCFG4_RTCEVENT_SEL(value)     (FUSES_DEVCFG4_RTCEVENT_SEL_Msk & (_UINT32_(value) << FUSES_DEVCFG4_RTCEVENT_SEL_Pos)) /* Assigment of value for RTCEVENT_SEL in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_RTCEVENT_SEL_ONE_SEC_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) 1-Second Clock  */
#define   FUSES_DEVCFG4_RTCEVENT_SEL_ALARM_PULSE_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Alarm Pulse  */
#define   FUSES_DEVCFG4_RTCEVENT_SEL_32_KHZ_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) 32 kHz Clock  */
#define FUSES_DEVCFG4_RTCEVENT_SEL_ONE_SEC    (FUSES_DEVCFG4_RTCEVENT_SEL_ONE_SEC_Val << FUSES_DEVCFG4_RTCEVENT_SEL_Pos) /* (FUSES_DEVCFG4) 1-Second Clock Position  */
#define FUSES_DEVCFG4_RTCEVENT_SEL_ALARM_PULSE (FUSES_DEVCFG4_RTCEVENT_SEL_ALARM_PULSE_Val << FUSES_DEVCFG4_RTCEVENT_SEL_Pos) /* (FUSES_DEVCFG4) Alarm Pulse Position  */
#define FUSES_DEVCFG4_RTCEVENT_SEL_32_KHZ     (FUSES_DEVCFG4_RTCEVENT_SEL_32_KHZ_Val << FUSES_DEVCFG4_RTCEVENT_SEL_Pos) /* (FUSES_DEVCFG4) 32 kHz Clock Position  */
#define FUSES_DEVCFG4_RTCEVENT_EN_Pos         _UINT32_(10)                                         /* (FUSES_DEVCFG4) Pad Output Enable for MCHP legacy RTC event output Position */
#define FUSES_DEVCFG4_RTCEVENT_EN_Msk         (_UINT32_(0x1) << FUSES_DEVCFG4_RTCEVENT_EN_Pos)     /* (FUSES_DEVCFG4) Pad Output Enable for MCHP legacy RTC event output Mask */
#define FUSES_DEVCFG4_RTCEVENT_EN(value)      (FUSES_DEVCFG4_RTCEVENT_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG4_RTCEVENT_EN_Pos)) /* Assigment of value for RTCEVENT_EN in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_RTCEVENT_EN_ON_Val    _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Enable RTC Event  */
#define   FUSES_DEVCFG4_RTCEVENT_EN_OFF_Val   _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Disable RTC Event  */
#define FUSES_DEVCFG4_RTCEVENT_EN_ON          (FUSES_DEVCFG4_RTCEVENT_EN_ON_Val << FUSES_DEVCFG4_RTCEVENT_EN_Pos) /* (FUSES_DEVCFG4) Enable RTC Event Position  */
#define FUSES_DEVCFG4_RTCEVENT_EN_OFF         (FUSES_DEVCFG4_RTCEVENT_EN_OFF_Val << FUSES_DEVCFG4_RTCEVENT_EN_Pos) /* (FUSES_DEVCFG4) Disable RTC Event Position  */
#define FUSES_DEVCFG4_VBKP_1KCSEL_Pos         _UINT32_(11)                                         /* (FUSES_DEVCFG4) VDDBUKPCORE LPCLK Clock Selection Position */
#define FUSES_DEVCFG4_VBKP_1KCSEL_Msk         (_UINT32_(0x1) << FUSES_DEVCFG4_VBKP_1KCSEL_Pos)     /* (FUSES_DEVCFG4) VDDBUKPCORE LPCLK Clock Selection Mask */
#define FUSES_DEVCFG4_VBKP_1KCSEL(value)      (FUSES_DEVCFG4_VBKP_1KCSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG4_VBKP_1KCSEL_Pos)) /* Assigment of value for VBKP_1KCSEL in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_VBKP_1KCSEL_1K_Val    _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Divide by 32 or 31.25 clock depending on VBKP_DIVSEL  */
#define   FUSES_DEVCFG4_VBKP_1KCSEL_32K_Val   _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) 32kHz low power clock  */
#define FUSES_DEVCFG4_VBKP_1KCSEL_1K          (FUSES_DEVCFG4_VBKP_1KCSEL_1K_Val << FUSES_DEVCFG4_VBKP_1KCSEL_Pos) /* (FUSES_DEVCFG4) Divide by 32 or 31.25 clock depending on VBKP_DIVSEL Position  */
#define FUSES_DEVCFG4_VBKP_1KCSEL_32K         (FUSES_DEVCFG4_VBKP_1KCSEL_32K_Val << FUSES_DEVCFG4_VBKP_1KCSEL_Pos) /* (FUSES_DEVCFG4) 32kHz low power clock Position  */
#define FUSES_DEVCFG4_VBKP_32KCSEL_Pos        _UINT32_(12)                                         /* (FUSES_DEVCFG4) VDDBUKPCORE 32kHz clock source selection Position */
#define FUSES_DEVCFG4_VBKP_32KCSEL_Msk        (_UINT32_(0x3) << FUSES_DEVCFG4_VBKP_32KCSEL_Pos)    /* (FUSES_DEVCFG4) VDDBUKPCORE 32kHz clock source selection Mask */
#define FUSES_DEVCFG4_VBKP_32KCSEL(value)     (FUSES_DEVCFG4_VBKP_32KCSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG4_VBKP_32KCSEL_Pos)) /* Assigment of value for VBKP_32KCSEL in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_VBKP_32KCSEL_FRC_Val  _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) FRC  */
#define   FUSES_DEVCFG4_VBKP_32KCSEL_POSC_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) POSC  */
#define   FUSES_DEVCFG4_VBKP_32KCSEL_SOSC_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG4) SOSC  */
#define   FUSES_DEVCFG4_VBKP_32KCSEL_LPRC_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG4) LPRC  */
#define FUSES_DEVCFG4_VBKP_32KCSEL_FRC        (FUSES_DEVCFG4_VBKP_32KCSEL_FRC_Val << FUSES_DEVCFG4_VBKP_32KCSEL_Pos) /* (FUSES_DEVCFG4) FRC Position  */
#define FUSES_DEVCFG4_VBKP_32KCSEL_POSC       (FUSES_DEVCFG4_VBKP_32KCSEL_POSC_Val << FUSES_DEVCFG4_VBKP_32KCSEL_Pos) /* (FUSES_DEVCFG4) POSC Position  */
#define FUSES_DEVCFG4_VBKP_32KCSEL_SOSC       (FUSES_DEVCFG4_VBKP_32KCSEL_SOSC_Val << FUSES_DEVCFG4_VBKP_32KCSEL_Pos) /* (FUSES_DEVCFG4) SOSC Position  */
#define FUSES_DEVCFG4_VBKP_32KCSEL_LPRC       (FUSES_DEVCFG4_VBKP_32KCSEL_LPRC_Val << FUSES_DEVCFG4_VBKP_32KCSEL_Pos) /* (FUSES_DEVCFG4) LPRC Position  */
#define FUSES_DEVCFG4_VBKP_DIVSEL_Pos         _UINT32_(14)                                         /* (FUSES_DEVCFG4) VDDBUKPCORE LPCLK Clock Divider Selection Position */
#define FUSES_DEVCFG4_VBKP_DIVSEL_Msk         (_UINT32_(0x1) << FUSES_DEVCFG4_VBKP_DIVSEL_Pos)     /* (FUSES_DEVCFG4) VDDBUKPCORE LPCLK Clock Divider Selection Mask */
#define FUSES_DEVCFG4_VBKP_DIVSEL(value)      (FUSES_DEVCFG4_VBKP_DIVSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG4_VBKP_DIVSEL_Pos)) /* Assigment of value for VBKP_DIVSEL in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_VBKP_DIVSEL_DIV_31_25_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Divide by 31.25 (Recommended when LPCLK=32kHz)  */
#define   FUSES_DEVCFG4_VBKP_DIVSEL_DIV_32_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Divide-by 32 (Recommended when LPCLK=32.768kHz))  */
#define FUSES_DEVCFG4_VBKP_DIVSEL_DIV_31_25   (FUSES_DEVCFG4_VBKP_DIVSEL_DIV_31_25_Val << FUSES_DEVCFG4_VBKP_DIVSEL_Pos) /* (FUSES_DEVCFG4) Divide by 31.25 (Recommended when LPCLK=32kHz) Position  */
#define FUSES_DEVCFG4_VBKP_DIVSEL_DIV_32      (FUSES_DEVCFG4_VBKP_DIVSEL_DIV_32_Val << FUSES_DEVCFG4_VBKP_DIVSEL_Pos) /* (FUSES_DEVCFG4) Divide-by 32 (Recommended when LPCLK=32.768kHz)) Position  */
#define FUSES_DEVCFG4_LPCLK_MOD_Pos           _UINT32_(15)                                         /* (FUSES_DEVCFG4) LPCLK modifier in counter/delay mode Position */
#define FUSES_DEVCFG4_LPCLK_MOD_Msk           (_UINT32_(0x1) << FUSES_DEVCFG4_LPCLK_MOD_Pos)       /* (FUSES_DEVCFG4) LPCLK modifier in counter/delay mode Mask */
#define FUSES_DEVCFG4_LPCLK_MOD(value)        (FUSES_DEVCFG4_LPCLK_MOD_Msk & (_UINT32_(value) << FUSES_DEVCFG4_LPCLK_MOD_Pos)) /* Assigment of value for LPCLK_MOD in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_LPCLK_MOD_DIV_1_Val   _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Divide-by 1 (Recommended when LPCLK=32kHz)  */
#define   FUSES_DEVCFG4_LPCLK_MOD_DIV_1_024_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Divide-by 1.024 (Recommended when LPCLK=32.768kHz)  */
#define FUSES_DEVCFG4_LPCLK_MOD_DIV_1         (FUSES_DEVCFG4_LPCLK_MOD_DIV_1_Val << FUSES_DEVCFG4_LPCLK_MOD_Pos) /* (FUSES_DEVCFG4) Divide-by 1 (Recommended when LPCLK=32kHz) Position  */
#define FUSES_DEVCFG4_LPCLK_MOD_DIV_1_024     (FUSES_DEVCFG4_LPCLK_MOD_DIV_1_024_Val << FUSES_DEVCFG4_LPCLK_MOD_Pos) /* (FUSES_DEVCFG4) Divide-by 1.024 (Recommended when LPCLK=32.768kHz) Position  */
#define FUSES_DEVCFG4_RTCEVTYPE_Pos           _UINT32_(16)                                         /* (FUSES_DEVCFG4) RTC Event Type Position */
#define FUSES_DEVCFG4_RTCEVTYPE_Msk           (_UINT32_(0x1) << FUSES_DEVCFG4_RTCEVTYPE_Pos)       /* (FUSES_DEVCFG4) RTC Event Type Mask */
#define FUSES_DEVCFG4_RTCEVTYPE(value)        (FUSES_DEVCFG4_RTCEVTYPE_Msk & (_UINT32_(value) << FUSES_DEVCFG4_RTCEVTYPE_Pos)) /* Assigment of value for RTCEVTYPE in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_RTCEVTYPE_EVENT_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) RTC_EVENT  */
#define   FUSES_DEVCFG4_RTCEVTYPE_OUT_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) RTC_OUT  */
#define FUSES_DEVCFG4_RTCEVTYPE_EVENT         (FUSES_DEVCFG4_RTCEVTYPE_EVENT_Val << FUSES_DEVCFG4_RTCEVTYPE_Pos) /* (FUSES_DEVCFG4) RTC_EVENT Position  */
#define FUSES_DEVCFG4_RTCEVTYPE_OUT           (FUSES_DEVCFG4_RTCEVTYPE_OUT_Val << FUSES_DEVCFG4_RTCEVTYPE_Pos) /* (FUSES_DEVCFG4) RTC_OUT Position  */
#define FUSES_DEVCFG4_CPEN_DLY_Pos            _UINT32_(17)                                         /* (FUSES_DEVCFG4) Charge-pump ready digital delay Position */
#define FUSES_DEVCFG4_CPEN_DLY_Msk            (_UINT32_(0x7) << FUSES_DEVCFG4_CPEN_DLY_Pos)        /* (FUSES_DEVCFG4) Charge-pump ready digital delay Mask */
#define FUSES_DEVCFG4_CPEN_DLY(value)         (FUSES_DEVCFG4_CPEN_DLY_Msk & (_UINT32_(value) << FUSES_DEVCFG4_CPEN_DLY_Pos)) /* Assigment of value for CPEN_DLY in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_CPEN_DLY_1_LPRC_Val   _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) 1 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_2_LPRC_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) 2 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_3_LPRC_Val   _UINT32_(0x2)                                        /* (FUSES_DEVCFG4) 3 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_4_LPRC_Val   _UINT32_(0x3)                                        /* (FUSES_DEVCFG4) 4 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_5_LPRC_Val   _UINT32_(0x4)                                        /* (FUSES_DEVCFG4) 5 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_6_LPRC_Val   _UINT32_(0x5)                                        /* (FUSES_DEVCFG4) 6 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_7_LPRC_Val   _UINT32_(0x6)                                        /* (FUSES_DEVCFG4) 7 LPRC Clock Cycle Delay  */
#define   FUSES_DEVCFG4_CPEN_DLY_8_LPRC_Val   _UINT32_(0x7)                                        /* (FUSES_DEVCFG4) 8 LPRC Clock Cycle Delay  */
#define FUSES_DEVCFG4_CPEN_DLY_1_LPRC         (FUSES_DEVCFG4_CPEN_DLY_1_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 1 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_2_LPRC         (FUSES_DEVCFG4_CPEN_DLY_2_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 2 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_3_LPRC         (FUSES_DEVCFG4_CPEN_DLY_3_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 3 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_4_LPRC         (FUSES_DEVCFG4_CPEN_DLY_4_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 4 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_5_LPRC         (FUSES_DEVCFG4_CPEN_DLY_5_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 5 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_6_LPRC         (FUSES_DEVCFG4_CPEN_DLY_6_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 6 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_7_LPRC         (FUSES_DEVCFG4_CPEN_DLY_7_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 7 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_CPEN_DLY_8_LPRC         (FUSES_DEVCFG4_CPEN_DLY_8_LPRC_Val << FUSES_DEVCFG4_CPEN_DLY_Pos) /* (FUSES_DEVCFG4) 8 LPRC Clock Cycle Delay Position  */
#define FUSES_DEVCFG4_DSZPBOREN_Pos           _UINT32_(20)                                         /* (FUSES_DEVCFG4) Deep Sleep Zero-Power BOR Enable Position */
#define FUSES_DEVCFG4_DSZPBOREN_Msk           (_UINT32_(0x1) << FUSES_DEVCFG4_DSZPBOREN_Pos)       /* (FUSES_DEVCFG4) Deep Sleep Zero-Power BOR Enable Mask */
#define FUSES_DEVCFG4_DSZPBOREN(value)        (FUSES_DEVCFG4_DSZPBOREN_Msk & (_UINT32_(value) << FUSES_DEVCFG4_DSZPBOREN_Pos)) /* Assigment of value for DSZPBOREN in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_DSZPBOREN_ON_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) Enabled  */
#define   FUSES_DEVCFG4_DSZPBOREN_OFF_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) Disabled  */
#define FUSES_DEVCFG4_DSZPBOREN_ON            (FUSES_DEVCFG4_DSZPBOREN_ON_Val << FUSES_DEVCFG4_DSZPBOREN_Pos) /* (FUSES_DEVCFG4) Enabled Position  */
#define FUSES_DEVCFG4_DSZPBOREN_OFF           (FUSES_DEVCFG4_DSZPBOREN_OFF_Val << FUSES_DEVCFG4_DSZPBOREN_Pos) /* (FUSES_DEVCFG4) Disabled Position  */
#define FUSES_DEVCFG4_DSWDTPS_Pos             _UINT32_(21)                                         /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Postscale Select Position */
#define FUSES_DEVCFG4_DSWDTPS_Msk             (_UINT32_(0x1F) << FUSES_DEVCFG4_DSWDTPS_Pos)        /* (FUSES_DEVCFG4) Deep Sleep Watchdog Timer Postscale Select Mask */
#define FUSES_DEVCFG4_DSWDTPS(value)          (FUSES_DEVCFG4_DSWDTPS_Msk & (_UINT32_(value) << FUSES_DEVCFG4_DSWDTPS_Pos)) /* Assigment of value for DSWDTPS in the FUSES_DEVCFG4 register */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS5_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG4) 1:32(1ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS6_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG4) 1:64(2.1ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS7_Val     _UINT32_(0x2)                                        /* (FUSES_DEVCFG4) 1:128(4.1ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS8_Val     _UINT32_(0x3)                                        /* (FUSES_DEVCFG4) 1:256(8.3ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS9_Val     _UINT32_(0x4)                                        /* (FUSES_DEVCFG4) 1:512(16.5ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS10_Val    _UINT32_(0x5)                                        /* (FUSES_DEVCFG4) 1:1024(33ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS11_Val    _UINT32_(0x6)                                        /* (FUSES_DEVCFG4) 1:2048(66.1ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS12_Val    _UINT32_(0x7)                                        /* (FUSES_DEVCFG4) 1:4096(132.1ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS13_Val    _UINT32_(0x8)                                        /* (FUSES_DEVCFG4) 1:8192(264.3ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS14_Val    _UINT32_(0x9)                                        /* (FUSES_DEVCFG4) 1:16384(528.5ms)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS15_Val    _UINT32_(0xA)                                        /* (FUSES_DEVCFG4) 1:32768(1.057s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS16_Val    _UINT32_(0xB)                                        /* (FUSES_DEVCFG4) 1:65536(2.114s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS17_Val    _UINT32_(0xC)                                        /* (FUSES_DEVCFG4) 1:2^17(4.288s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS18_Val    _UINT32_(0xD)                                        /* (FUSES_DEVCFG4) 1:2^18(8.456s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS19_Val    _UINT32_(0xE)                                        /* (FUSES_DEVCFG4) 1:2^19(16.912s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS20_Val    _UINT32_(0xF)                                        /* (FUSES_DEVCFG4) 1:2^20(33.825s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS21_Val    _UINT32_(0x10)                                       /* (FUSES_DEVCFG4) 1:2^21(67.7s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS22_Val    _UINT32_(0x11)                                       /* (FUSES_DEVCFG4) 1:2^22(135.3s)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS23_Val    _UINT32_(0x12)                                       /* (FUSES_DEVCFG4) 1:2^23(4.5 minutes)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS24_Val    _UINT32_(0x13)                                       /* (FUSES_DEVCFG4) 1:2^24(9.0 minutes)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS25_Val    _UINT32_(0x14)                                       /* (FUSES_DEVCFG4) 1:2^25(18.0 minutes)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS26_Val    _UINT32_(0x15)                                       /* (FUSES_DEVCFG4) 1:2^26(36.1 minutes)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS27_Val    _UINT32_(0x16)                                       /* (FUSES_DEVCFG4) 1:2^27(72.2 minutes)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS28_Val    _UINT32_(0x17)                                       /* (FUSES_DEVCFG4) 1:2^28(2.4 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS29_Val    _UINT32_(0x18)                                       /* (FUSES_DEVCFG4) 1:2^29(4.8 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS30_Val    _UINT32_(0x19)                                       /* (FUSES_DEVCFG4) 1:2^30(9.6 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS31_Val    _UINT32_(0x1A)                                       /* (FUSES_DEVCFG4) 1:2^31(19.2 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS32_Val    _UINT32_(0x1B)                                       /* (FUSES_DEVCFG4) 1:2^32(38.5 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS33_Val    _UINT32_(0x1C)                                       /* (FUSES_DEVCFG4) 1:2^33(77.0 hours)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS34_Val    _UINT32_(0x1D)                                       /* (FUSES_DEVCFG4) 1:2^34(6.4 days)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS35_Val    _UINT32_(0x1E)                                       /* (FUSES_DEVCFG4) 1:2^35(12.8 days)  */
#define   FUSES_DEVCFG4_DSWDTPS_DSPS36_Val    _UINT32_(0x1F)                                       /* (FUSES_DEVCFG4) 1:2^36(25.7 days)  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS5           (FUSES_DEVCFG4_DSWDTPS_DSPS5_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:32(1ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS6           (FUSES_DEVCFG4_DSWDTPS_DSPS6_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:64(2.1ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS7           (FUSES_DEVCFG4_DSWDTPS_DSPS7_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:128(4.1ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS8           (FUSES_DEVCFG4_DSWDTPS_DSPS8_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:256(8.3ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS9           (FUSES_DEVCFG4_DSWDTPS_DSPS9_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:512(16.5ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS10          (FUSES_DEVCFG4_DSWDTPS_DSPS10_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:1024(33ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS11          (FUSES_DEVCFG4_DSWDTPS_DSPS11_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2048(66.1ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS12          (FUSES_DEVCFG4_DSWDTPS_DSPS12_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:4096(132.1ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS13          (FUSES_DEVCFG4_DSWDTPS_DSPS13_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:8192(264.3ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS14          (FUSES_DEVCFG4_DSWDTPS_DSPS14_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:16384(528.5ms) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS15          (FUSES_DEVCFG4_DSWDTPS_DSPS15_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:32768(1.057s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS16          (FUSES_DEVCFG4_DSWDTPS_DSPS16_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:65536(2.114s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS17          (FUSES_DEVCFG4_DSWDTPS_DSPS17_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^17(4.288s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS18          (FUSES_DEVCFG4_DSWDTPS_DSPS18_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^18(8.456s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS19          (FUSES_DEVCFG4_DSWDTPS_DSPS19_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^19(16.912s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS20          (FUSES_DEVCFG4_DSWDTPS_DSPS20_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^20(33.825s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS21          (FUSES_DEVCFG4_DSWDTPS_DSPS21_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^21(67.7s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS22          (FUSES_DEVCFG4_DSWDTPS_DSPS22_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^22(135.3s) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS23          (FUSES_DEVCFG4_DSWDTPS_DSPS23_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^23(4.5 minutes) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS24          (FUSES_DEVCFG4_DSWDTPS_DSPS24_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^24(9.0 minutes) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS25          (FUSES_DEVCFG4_DSWDTPS_DSPS25_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^25(18.0 minutes) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS26          (FUSES_DEVCFG4_DSWDTPS_DSPS26_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^26(36.1 minutes) Position  */
#define FUSES_DEVCFG4_DSWDTPS_DSPS27          (FUSES_DEVCFG4_DSWDTPS_DSPS27_Val << FUSES_DEVCFG4_DSWDTPS_Pos) /* (FUSES_DEVCFG4) 1:2^27(72.2 minutes) Position  */
