Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_rfd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/fuses.h
#define FUSES_DEVCFG2_ACMP_CYCLE_Pos          _UINT32_(0)                                          /* (FUSES_DEVCFG2) AC Comparator Result Wait Cycles Position */
#define FUSES_DEVCFG2_ACMP_CYCLE_Msk          (_UINT32_(0x7) << FUSES_DEVCFG2_ACMP_CYCLE_Pos)      /* (FUSES_DEVCFG2) AC Comparator Result Wait Cycles Mask */
#define FUSES_DEVCFG2_ACMP_CYCLE(value)       (FUSES_DEVCFG2_ACMP_CYCLE_Msk & (_UINT32_(value) << FUSES_DEVCFG2_ACMP_CYCLE_Pos)) /* Assigment of value for ACMP_CYCLE in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_ACMP_CYCLE_32US_Val   _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) 32us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_64US_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) 64us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_96US_Val   _UINT32_(0x2)                                        /* (FUSES_DEVCFG2) 96us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_128US_Val  _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) 128us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_160US_Val  _UINT32_(0x4)                                        /* (FUSES_DEVCFG2) 160us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_196US_Val  _UINT32_(0x5)                                        /* (FUSES_DEVCFG2) 196us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_224US_Val  _UINT32_(0x6)                                        /* (FUSES_DEVCFG2) 224us  */
#define   FUSES_DEVCFG2_ACMP_CYCLE_256US_Val  _UINT32_(0x7)                                        /* (FUSES_DEVCFG2) 256us  */
#define FUSES_DEVCFG2_ACMP_CYCLE_32US         (FUSES_DEVCFG2_ACMP_CYCLE_32US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 32us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_64US         (FUSES_DEVCFG2_ACMP_CYCLE_64US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 64us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_96US         (FUSES_DEVCFG2_ACMP_CYCLE_96US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 96us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_128US        (FUSES_DEVCFG2_ACMP_CYCLE_128US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 128us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_160US        (FUSES_DEVCFG2_ACMP_CYCLE_160US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 160us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_196US        (FUSES_DEVCFG2_ACMP_CYCLE_196US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 196us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_224US        (FUSES_DEVCFG2_ACMP_CYCLE_224US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 224us Position  */
#define FUSES_DEVCFG2_ACMP_CYCLE_256US        (FUSES_DEVCFG2_ACMP_CYCLE_256US_Val << FUSES_DEVCFG2_ACMP_CYCLE_Pos) /* (FUSES_DEVCFG2) 256us Position  */
#define FUSES_DEVCFG2_DMTINTV_Pos             _UINT32_(3)                                          /* (FUSES_DEVCFG2) Dead Man Timer Count Window Interval Position */
#define FUSES_DEVCFG2_DMTINTV_Msk             (_UINT32_(0x7) << FUSES_DEVCFG2_DMTINTV_Pos)         /* (FUSES_DEVCFG2) Dead Man Timer Count Window Interval Mask */
#define FUSES_DEVCFG2_DMTINTV(value)          (FUSES_DEVCFG2_DMTINTV_Msk & (_UINT32_(value) << FUSES_DEVCFG2_DMTINTV_Pos)) /* Assigment of value for DMTINTV in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_DMTINTV_WIN_0_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) Window/Interval value is zero  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_1_2_Val   _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) Window/Interval value is 1/2 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_3_4_Val   _UINT32_(0x2)                                        /* (FUSES_DEVCFG2) Window/Interval value is 3/4 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_7_8_Val   _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) Window/Interval value is 7/8 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_15_16_Val _UINT32_(0x4)                                        /* (FUSES_DEVCFG2) Window/Interval value is 15/16 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_31_32_Val _UINT32_(0x5)                                        /* (FUSES_DEVCFG2) Window/Interval value is 31/32 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_63_64_Val _UINT32_(0x6)                                        /* (FUSES_DEVCFG2) Window/Interval value is 63/64 counter value  */
#define   FUSES_DEVCFG2_DMTINTV_WIN_127_128_Val _UINT32_(0x7)                                        /* (FUSES_DEVCFG2) Window/Interval value is 127/128 counter value  */
#define FUSES_DEVCFG2_DMTINTV_WIN_0           (FUSES_DEVCFG2_DMTINTV_WIN_0_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is zero Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_1_2         (FUSES_DEVCFG2_DMTINTV_WIN_1_2_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 1/2 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_3_4         (FUSES_DEVCFG2_DMTINTV_WIN_3_4_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 3/4 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_7_8         (FUSES_DEVCFG2_DMTINTV_WIN_7_8_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 7/8 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_15_16       (FUSES_DEVCFG2_DMTINTV_WIN_15_16_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 15/16 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_31_32       (FUSES_DEVCFG2_DMTINTV_WIN_31_32_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 31/32 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_63_64       (FUSES_DEVCFG2_DMTINTV_WIN_63_64_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 63/64 counter value Position  */
#define FUSES_DEVCFG2_DMTINTV_WIN_127_128     (FUSES_DEVCFG2_DMTINTV_WIN_127_128_Val << FUSES_DEVCFG2_DMTINTV_Pos) /* (FUSES_DEVCFG2) Window/Interval value is 127/128 counter value Position  */
#define FUSES_DEVCFG2_PMUTEST_VDD_EN_Pos      _UINT32_(7)                                          /* (FUSES_DEVCFG2) PMU Test Output or VDD/2 Enable via ADC IE12 Position */
#define FUSES_DEVCFG2_PMUTEST_VDD_EN_Msk      (_UINT32_(0x1) << FUSES_DEVCFG2_PMUTEST_VDD_EN_Pos)  /* (FUSES_DEVCFG2) PMU Test Output or VDD/2 Enable via ADC IE12 Mask */
#define FUSES_DEVCFG2_PMUTEST_VDD_EN(value)   (FUSES_DEVCFG2_PMUTEST_VDD_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG2_PMUTEST_VDD_EN_Pos)) /* Assigment of value for PMUTEST_VDD_EN in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_PMUTEST_VDD_EN_PMU_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) PMU Test Output Monitor  */
#define   FUSES_DEVCFG2_PMUTEST_VDD_EN_VDD_DIV_2_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) VDD_div_2 Monitor  */
#define FUSES_DEVCFG2_PMUTEST_VDD_EN_PMU      (FUSES_DEVCFG2_PMUTEST_VDD_EN_PMU_Val << FUSES_DEVCFG2_PMUTEST_VDD_EN_Pos) /* (FUSES_DEVCFG2) PMU Test Output Monitor Position  */
#define FUSES_DEVCFG2_PMUTEST_VDD_EN_VDD_DIV_2 (FUSES_DEVCFG2_PMUTEST_VDD_EN_VDD_DIV_2_Val << FUSES_DEVCFG2_PMUTEST_VDD_EN_Pos) /* (FUSES_DEVCFG2) VDD_div_2 Monitor Position  */
#define FUSES_DEVCFG2_POSCMOD_Pos             _UINT32_(8)                                          /* (FUSES_DEVCFG2) Primary Oscillator Configuration Position */
#define FUSES_DEVCFG2_POSCMOD_Msk             (_UINT32_(0x3) << FUSES_DEVCFG2_POSCMOD_Pos)         /* (FUSES_DEVCFG2) Primary Oscillator Configuration Mask */
#define FUSES_DEVCFG2_POSCMOD(value)          (FUSES_DEVCFG2_POSCMOD_Msk & (_UINT32_(value) << FUSES_DEVCFG2_POSCMOD_Pos)) /* Assigment of value for POSCMOD in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_POSCMOD_OFF_Val       _UINT32_(0x3)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_POSCMOD_HS_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_POSCMOD_OFF             (FUSES_DEVCFG2_POSCMOD_OFF_Val << FUSES_DEVCFG2_POSCMOD_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_POSCMOD_HS              (FUSES_DEVCFG2_POSCMOD_HS_Val << FUSES_DEVCFG2_POSCMOD_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTRMCS_Pos             _UINT32_(10)                                         /* (FUSES_DEVCFG2) WDT RUN Mode Clock Select Position */
#define FUSES_DEVCFG2_WDTRMCS_Msk             (_UINT32_(0x3) << FUSES_DEVCFG2_WDTRMCS_Pos)         /* (FUSES_DEVCFG2) WDT RUN Mode Clock Select Mask */
#define FUSES_DEVCFG2_WDTRMCS(value)          (FUSES_DEVCFG2_WDTRMCS_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WDTRMCS_Pos)) /* Assigment of value for WDTRMCS in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WDTRMCS_LPRC_Val      _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) LPRC  */
#define   FUSES_DEVCFG2_WDTRMCS_SYSCLK_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) SYSCLK  */
#define FUSES_DEVCFG2_WDTRMCS_LPRC            (FUSES_DEVCFG2_WDTRMCS_LPRC_Val << FUSES_DEVCFG2_WDTRMCS_Pos) /* (FUSES_DEVCFG2) LPRC Position  */
#define FUSES_DEVCFG2_WDTRMCS_SYSCLK          (FUSES_DEVCFG2_WDTRMCS_SYSCLK_Val << FUSES_DEVCFG2_WDTRMCS_Pos) /* (FUSES_DEVCFG2) SYSCLK Position  */
#define FUSES_DEVCFG2_SOSCSEL_Pos             _UINT32_(12)                                         /* (FUSES_DEVCFG2) SOSC Selection Configuration Position */
#define FUSES_DEVCFG2_SOSCSEL_Msk             (_UINT32_(0x1) << FUSES_DEVCFG2_SOSCSEL_Pos)         /* (FUSES_DEVCFG2) SOSC Selection Configuration Mask */
#define FUSES_DEVCFG2_SOSCSEL(value)          (FUSES_DEVCFG2_SOSCSEL_Msk & (_UINT32_(value) << FUSES_DEVCFG2_SOSCSEL_Pos)) /* Assigment of value for SOSCSEL in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_SOSCSEL_XTAL_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_SOSCSEL_SCLKI_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_SOSCSEL_XTAL            (FUSES_DEVCFG2_SOSCSEL_XTAL_Val << FUSES_DEVCFG2_SOSCSEL_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_SOSCSEL_SCLKI           (FUSES_DEVCFG2_SOSCSEL_SCLKI_Val << FUSES_DEVCFG2_SOSCSEL_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WAKE2SPD_Pos            _UINT32_(13)                                         /* (FUSES_DEVCFG2) 2-Speed startup enabled in Sleep mode Position */
#define FUSES_DEVCFG2_WAKE2SPD_Msk            (_UINT32_(0x1) << FUSES_DEVCFG2_WAKE2SPD_Pos)        /* (FUSES_DEVCFG2) 2-Speed startup enabled in Sleep mode Mask */
#define FUSES_DEVCFG2_WAKE2SPD(value)         (FUSES_DEVCFG2_WAKE2SPD_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WAKE2SPD_Pos)) /* Assigment of value for WAKE2SPD in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WAKE2SPD_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_WAKE2SPD_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_WAKE2SPD_ON             (FUSES_DEVCFG2_WAKE2SPD_ON_Val << FUSES_DEVCFG2_WAKE2SPD_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WAKE2SPD_OFF            (FUSES_DEVCFG2_WAKE2SPD_OFF_Val << FUSES_DEVCFG2_WAKE2SPD_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_CKSWEN_Pos              _UINT32_(14)                                         /* (FUSES_DEVCFG2) Software Clock Switching Enable Position */
#define FUSES_DEVCFG2_CKSWEN_Msk              (_UINT32_(0x1) << FUSES_DEVCFG2_CKSWEN_Pos)          /* (FUSES_DEVCFG2) Software Clock Switching Enable Mask */
#define FUSES_DEVCFG2_CKSWEN(value)           (FUSES_DEVCFG2_CKSWEN_Msk & (_UINT32_(value) << FUSES_DEVCFG2_CKSWEN_Pos)) /* Assigment of value for CKSWEN in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_CKSWEN_ON_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_CKSWEN_OFF_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_CKSWEN_ON               (FUSES_DEVCFG2_CKSWEN_ON_Val << FUSES_DEVCFG2_CKSWEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_CKSWEN_OFF              (FUSES_DEVCFG2_CKSWEN_OFF_Val << FUSES_DEVCFG2_CKSWEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_FSCMEN_Pos              _UINT32_(15)                                         /* (FUSES_DEVCFG2) Fail-Safe Clock Monitor Enable Position */
#define FUSES_DEVCFG2_FSCMEN_Msk              (_UINT32_(0x1) << FUSES_DEVCFG2_FSCMEN_Pos)          /* (FUSES_DEVCFG2) Fail-Safe Clock Monitor Enable Mask */
#define FUSES_DEVCFG2_FSCMEN(value)           (FUSES_DEVCFG2_FSCMEN_Msk & (_UINT32_(value) << FUSES_DEVCFG2_FSCMEN_Pos)) /* Assigment of value for FSCMEN in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_FSCMEN_ON_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_FSCMEN_OFF_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_FSCMEN_ON               (FUSES_DEVCFG2_FSCMEN_ON_Val << FUSES_DEVCFG2_FSCMEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_FSCMEN_OFF              (FUSES_DEVCFG2_FSCMEN_OFF_Val << FUSES_DEVCFG2_FSCMEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTPSR_Pos              _UINT32_(16)                                         /* (FUSES_DEVCFG2) Watchdog Timer Post-scale Select Run Position */
#define FUSES_DEVCFG2_WDTPSR_Msk              (_UINT32_(0x1F) << FUSES_DEVCFG2_WDTPSR_Pos)         /* (FUSES_DEVCFG2) Watchdog Timer Post-scale Select Run Mask */
#define FUSES_DEVCFG2_WDTPSR(value)           (FUSES_DEVCFG2_WDTPSR_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WDTPSR_Pos)) /* Assigment of value for WDTPSR in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WDTPSR_PS1_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG2) 1:1  */
#define   FUSES_DEVCFG2_WDTPSR_PS2_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) 1:2  */
#define   FUSES_DEVCFG2_WDTPSR_PS4_Val        _UINT32_(0x2)                                        /* (FUSES_DEVCFG2) 1:4  */
#define   FUSES_DEVCFG2_WDTPSR_PS8_Val        _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) 1:8  */
#define   FUSES_DEVCFG2_WDTPSR_PS16_Val       _UINT32_(0x4)                                        /* (FUSES_DEVCFG2) 1:16  */
#define   FUSES_DEVCFG2_WDTPSR_PS32_Val       _UINT32_(0x5)                                        /* (FUSES_DEVCFG2) 1:32  */
#define   FUSES_DEVCFG2_WDTPSR_PS64_Val       _UINT32_(0x6)                                        /* (FUSES_DEVCFG2) 1:64  */
#define   FUSES_DEVCFG2_WDTPSR_PS128_Val      _UINT32_(0x7)                                        /* (FUSES_DEVCFG2) 1:128  */
#define   FUSES_DEVCFG2_WDTPSR_PS256_Val      _UINT32_(0x8)                                        /* (FUSES_DEVCFG2) 1:256  */
#define   FUSES_DEVCFG2_WDTPSR_PS512_Val      _UINT32_(0x9)                                        /* (FUSES_DEVCFG2) 1:512  */
#define   FUSES_DEVCFG2_WDTPSR_PS1024_Val     _UINT32_(0xA)                                        /* (FUSES_DEVCFG2) 1:1024  */
#define   FUSES_DEVCFG2_WDTPSR_PS2048_Val     _UINT32_(0xB)                                        /* (FUSES_DEVCFG2) 1:2048  */
#define   FUSES_DEVCFG2_WDTPSR_PS4096_Val     _UINT32_(0xC)                                        /* (FUSES_DEVCFG2) 1:4096  */
#define   FUSES_DEVCFG2_WDTPSR_PS8192_Val     _UINT32_(0xD)                                        /* (FUSES_DEVCFG2) 1:8192  */
#define   FUSES_DEVCFG2_WDTPSR_PS16384_Val    _UINT32_(0xE)                                        /* (FUSES_DEVCFG2) 1:16384  */
#define   FUSES_DEVCFG2_WDTPSR_PS32768_Val    _UINT32_(0xF)                                        /* (FUSES_DEVCFG2) 1:32768  */
#define   FUSES_DEVCFG2_WDTPSR_PS65536_Val    _UINT32_(0x10)                                       /* (FUSES_DEVCFG2) 1:65536  */
#define   FUSES_DEVCFG2_WDTPSR_PS131072_Val   _UINT32_(0x11)                                       /* (FUSES_DEVCFG2) 1:131072  */
#define   FUSES_DEVCFG2_WDTPSR_PS262144_Val   _UINT32_(0x12)                                       /* (FUSES_DEVCFG2) 1:262144  */
#define   FUSES_DEVCFG2_WDTPSR_PS524288_Val   _UINT32_(0x13)                                       /* (FUSES_DEVCFG2) 1:524288  */
#define   FUSES_DEVCFG2_WDTPSR_PS1048576_Val  _UINT32_(0x14)                                       /* (FUSES_DEVCFG2) 1:1048576  */
#define FUSES_DEVCFG2_WDTPSR_PS1              (FUSES_DEVCFG2_WDTPSR_PS1_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:1 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS2              (FUSES_DEVCFG2_WDTPSR_PS2_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:2 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS4              (FUSES_DEVCFG2_WDTPSR_PS4_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:4 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS8              (FUSES_DEVCFG2_WDTPSR_PS8_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:8 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS16             (FUSES_DEVCFG2_WDTPSR_PS16_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:16 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS32             (FUSES_DEVCFG2_WDTPSR_PS32_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:32 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS64             (FUSES_DEVCFG2_WDTPSR_PS64_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:64 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS128            (FUSES_DEVCFG2_WDTPSR_PS128_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:128 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS256            (FUSES_DEVCFG2_WDTPSR_PS256_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:256 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS512            (FUSES_DEVCFG2_WDTPSR_PS512_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:512 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS1024           (FUSES_DEVCFG2_WDTPSR_PS1024_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:1024 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS2048           (FUSES_DEVCFG2_WDTPSR_PS2048_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:2048 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS4096           (FUSES_DEVCFG2_WDTPSR_PS4096_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:4096 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS8192           (FUSES_DEVCFG2_WDTPSR_PS8192_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:8192 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS16384          (FUSES_DEVCFG2_WDTPSR_PS16384_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:16384 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS32768          (FUSES_DEVCFG2_WDTPSR_PS32768_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:32768 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS65536          (FUSES_DEVCFG2_WDTPSR_PS65536_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:65536 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS131072         (FUSES_DEVCFG2_WDTPSR_PS131072_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:131072 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS262144         (FUSES_DEVCFG2_WDTPSR_PS262144_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:262144 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS524288         (FUSES_DEVCFG2_WDTPSR_PS524288_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:524288 Position  */
#define FUSES_DEVCFG2_WDTPSR_PS1048576        (FUSES_DEVCFG2_WDTPSR_PS1048576_Val << FUSES_DEVCFG2_WDTPSR_Pos) /* (FUSES_DEVCFG2) 1:1048576 Position  */
#define FUSES_DEVCFG2_WDTSPGM_Pos             _UINT32_(21)                                         /* (FUSES_DEVCFG2) Watchdog Timer Stop during Flash Programming Position */
#define FUSES_DEVCFG2_WDTSPGM_Msk             (_UINT32_(0x1) << FUSES_DEVCFG2_WDTSPGM_Pos)         /* (FUSES_DEVCFG2) Watchdog Timer Stop during Flash Programming Mask */
#define FUSES_DEVCFG2_WDTSPGM(value)          (FUSES_DEVCFG2_WDTSPGM_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WDTSPGM_Pos)) /* Assigment of value for WDTSPGM in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WDTSPGM_STOPS_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_WDTSPGM_RUNS_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_WDTSPGM_STOPS           (FUSES_DEVCFG2_WDTSPGM_STOPS_Val << FUSES_DEVCFG2_WDTSPGM_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTSPGM_RUNS            (FUSES_DEVCFG2_WDTSPGM_RUNS_Val << FUSES_DEVCFG2_WDTSPGM_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WINDIS_Pos              _UINT32_(22)                                         /* (FUSES_DEVCFG2) Windowed Watchdog Timer Disable Position */
#define FUSES_DEVCFG2_WINDIS_Msk              (_UINT32_(0x1) << FUSES_DEVCFG2_WINDIS_Pos)          /* (FUSES_DEVCFG2) Windowed Watchdog Timer Disable Mask */
#define FUSES_DEVCFG2_WINDIS(value)           (FUSES_DEVCFG2_WINDIS_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WINDIS_Pos)) /* Assigment of value for WINDIS in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WINDIS_NORMAL_Val     _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_WINDIS_WINDOW_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_WINDIS_NORMAL           (FUSES_DEVCFG2_WINDIS_NORMAL_Val << FUSES_DEVCFG2_WINDIS_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WINDIS_WINDOW           (FUSES_DEVCFG2_WINDIS_WINDOW_Val << FUSES_DEVCFG2_WINDIS_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTEN_Pos               _UINT32_(23)                                         /* (FUSES_DEVCFG2) Watchdog Timer Enable Position */
#define FUSES_DEVCFG2_WDTEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG2_WDTEN_Pos)           /* (FUSES_DEVCFG2) Watchdog Timer Enable Mask */
#define FUSES_DEVCFG2_WDTEN(value)            (FUSES_DEVCFG2_WDTEN_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WDTEN_Pos)) /* Assigment of value for WDTEN in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WDTEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG2)   */
#define   FUSES_DEVCFG2_WDTEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG2)   */
#define FUSES_DEVCFG2_WDTEN_ON                (FUSES_DEVCFG2_WDTEN_ON_Val << FUSES_DEVCFG2_WDTEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTEN_OFF               (FUSES_DEVCFG2_WDTEN_OFF_Val << FUSES_DEVCFG2_WDTEN_Pos) /* (FUSES_DEVCFG2)  Position  */
#define FUSES_DEVCFG2_WDTWINSZ_Pos            _UINT32_(24)                                         /* (FUSES_DEVCFG2) Watchdog Timer Window Size Position */
#define FUSES_DEVCFG2_WDTWINSZ_Msk            (_UINT32_(0x3) << FUSES_DEVCFG2_WDTWINSZ_Pos)        /* (FUSES_DEVCFG2) Watchdog Timer Window Size Mask */
#define FUSES_DEVCFG2_WDTWINSZ(value)         (FUSES_DEVCFG2_WDTWINSZ_Msk & (_UINT32_(value) << FUSES_DEVCFG2_WDTWINSZ_Pos)) /* Assigment of value for WDTWINSZ in the FUSES_DEVCFG2 register */
#define   FUSES_DEVCFG2_WDTWINSZ_WINSZ_25_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG2) Window size is 25%  */
#define   FUSES_DEVCFG2_WDTWINSZ_WINSZ_37_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG2) Window size is 37.5%  */
#define   FUSES_DEVCFG2_WDTWINSZ_WINSZ_50_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG2) Window size is 50%  */
